sff_recommender.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-16 Mon 17:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Speculative fiction recommender</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Speculative fiction recommender</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4b75391">Data</a></li>
<li><a href="#org4fda28e">The model</a></li>
<li><a href="#org53cfa81">Similar books</a>
<ul>
<li><a href="#org3bc2919">Without summary</a></li>
<li><a href="#orgae7786d">With summary</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div class="org-src-container">
<pre class="src src-jupyter-python">%load_ext autoreload
%autoreload 2

<span style="color: #fb4934;">import</span> gensim
<span style="color: #fb4934;">import</span> pandas <span style="color: #fb4934;">as</span> pd
<span style="color: #fb4934;">import</span> numpy <span style="color: #fb4934;">as</span> np
<span style="color: #fb4934;">from</span> true_neutral <span style="color: #fb4934;">import</span> *
</pre>
</div>

<div id="outline-container-org4b75391" class="outline-2">
<h2 id="org4b75391">Data</h2>
<div class="outline-text-2" id="text-org4b75391">
<p>
For demonstration I will use science fiction and fantasy books from the
excellent <a href="http://www.cs.cmu.edu/~dbamman/booksummaries.html">CMU Book Summary Dataset</a> (<a href="https://arxiv.org/abs/1305.1319">arXiv:1305.1319 [cs.CL]​</a>). Though curated,
the dataset has many missing entries, and books from many other genres. For the
present purposes I have removed books with missing values, and selected science
fiction and fantasy books published between 1722 and 2012.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #8ec07c;">data</span> = pd.read_pickle<span style="color: #fb4934;">(</span><span style="color: #b8bb26;">"true_neutral/data/sff_booksummaries.pkl"</span><span style="color: #fb4934;">)</span>
<span style="color: #fb4934;">print</span><span style="color: #fb4934;">(</span>data.head<span style="color: #fabd2f;">()</span><span style="color: #fb4934;">)</span>
</pre>
</div>

<pre class="example" id="org1107556">
   Wikipedia ID                              Title           Author  \
0           843                 A Clockwork Orange  Anthony Burgess
1          4081    Blade Runner 3: Replicant Night      K. W. Jeter
2          4082  Blade Runner 2: The Edge of Human      K. W. Jeter
3          6628                   Children of Dune    Frank Herbert
4          6630                  Chapterhouse Dune    Frank Herbert

                                              Genres  \
0  Science Fiction, Novella, Speculative fiction,...
1               Science Fiction, Speculative fiction
2               Science Fiction, Speculative fiction
3  Science Fiction, Speculative fiction, Children...
4  Science Fiction, Speculative fiction, Children...

                                             Summary  Year
0   Alex, a teenager living in near-future Englan...  1962
1   Living on Mars, Deckard is acting as a consul...  1996
2   Beginning several months after the events in ...  1995
3   Nine years after Emperor Paul Muad'dib walked...  1976
4   The situation is desperate for the Bene Gesse...  1985
</pre>
</div>
</div>

<div id="outline-container-org4fda28e" class="outline-2">
<h2 id="org4fda28e">The model</h2>
<div class="outline-text-2" id="text-org4fda28e">
<p>
I have used a Doc2Vec model with a vector size with 50 dimensions and 40
training epochs (for details check this <a href="https://radimrehurek.com/gensim/auto_examples/tutorials/run_doc2vec_lee.html#training-the-model">tutorial</a>). The trained model is saved in
the <code>true_neutral/data/</code> folder.
</p>

<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #8ec07c;">model</span> = gensim.models.doc2vec.Doc2Vec<span style="color: #fb4934;">(</span>vector_size=50, min_count=2, epochs=40,<span style="color: #fb4934;">)</span>
<span style="color: #8ec07c;">model_data</span> = train_model<span style="color: #fb4934;">(</span>model, data<span style="color: #fb4934;">)</span>
save_trained_model<span style="color: #fb4934;">(</span>*model_data, <span style="color: #b8bb26;">"cmu_sff"</span>, <span style="color: #b8bb26;">"true_neutral/data/"</span><span style="color: #fb4934;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org53cfa81" class="outline-2">
<h2 id="org53cfa81">Similar books</h2>
<div class="outline-text-2" id="text-org53cfa81">
<p>
The correlation factor shows how close the model thinks the books are, which it
determines using cosine similarity.
</p>
</div>

<div id="outline-container-org3bc2919" class="outline-3">
<h3 id="org3bc2919">Without summary</h3>
<div class="outline-text-3" id="text-org3bc2919">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #8ec07c;">books</span> = get_similar_books<span style="color: #fb4934;">(</span>model_data, <span style="color: #b8bb26;">"A Clockwork Orange"</span><span style="color: #fb4934;">)</span>
pprint_books<span style="color: #fb4934;">(</span>books<span style="color: #fb4934;">)</span>
</pre>
</div>

<pre class="example" id="org287fef6">
Heart of a Dog by Mikhail Bulgakov
Genres: Science Fiction, Speculative fiction
Correlation: 0.64


The Damnation Game by Clive Barker
Genres: Speculative fiction, Fantasy
Correlation: 0.60


Market Forces by Richard Morgan
Genres: Science Fiction, Speculative fiction, Fiction
Correlation: 0.59


Martian Time-Slip by Philip K. Dick
Genres: Science Fiction, Speculative fiction, Fiction, Novel
Correlation: 0.58


Next by Michael Crichton
Genres: Science Fiction, Satire, Techno-thriller, Utopian and dystopian fiction, Fiction
Correlation: 0.57


Behold the Man by Michael Moorcock
Genres: Science Fiction, Speculative fiction, Fantasy, Fiction
Correlation: 0.56


Camp Concentration by Thomas M. Disch
Genres: Science Fiction, Speculative fiction, Fiction, Dystopia
Correlation: 0.56


Some of Your Blood by Theodore Sturgeon
Genres: Science Fiction, Horror, Fiction
Correlation: 0.56


Gladiator at Law by Cyril M. Kornbluth
Genres: Science Fiction, Speculative fiction
Correlation: 0.56


The Cabinet of Curiosities by Lincoln Child
Genres: Thriller, Science Fiction, Speculative fiction, Fiction
Correlation: 0.55
</pre>
</div>
</div>

<div id="outline-container-orgae7786d" class="outline-3">
<h3 id="orgae7786d">With summary</h3>
<div class="outline-text-3" id="text-orgae7786d">
<div class="org-src-container">
<pre class="src src-jupyter-python"><span style="color: #8ec07c;">books</span> = get_similar_books<span style="color: #fb4934;">(</span>model_data, <span style="color: #b8bb26;">"Children of Dune"</span>, nsim=5, show_summary=<span style="color: #d3869b;">True</span><span style="color: #fb4934;">)</span>
pprint_books<span style="color: #fb4934;">(</span>books<span style="color: #fb4934;">)</span>
</pre>
</div>

<pre class="example" id="orgdef2227">
Dune Messiah by Frank Herbert
Genres: Science Fiction, Speculative fiction, Children's literature, Fiction, Novel
Correlation: 0.83
Summary:
Paul has refused to father a child with Irulan (or even touch her), but his Fremen concubine Chani has also failed to produce an heir, causing tension within his monarchy.
The Tleilaxu Face Dancer Scytale gives Paul a gift he cannot resist: a Tleilaxu-grown ghola of the deceased Duncan Idaho, Paul's childhood teacher and friend, now called "Hayt".
Furthermore, Paul's acceptance of the gift weakens his support among the Fremen, who see the Tleilaxu and their tools as unclean.
Bijaz programs Hayt to offer Paul a bargain when Chani dies: Chani's rebirth as a ghola, and the hope that Duncan Idaho's memories might be reawakened, in return for Paul sacrificing the throne and going into exile.
Bijaz also implants a compulsion that will force Hayt to attempt to kill Paul, given the appropriate circumstances.
Paul refuses to submit to the possibility that the Tleilaxu might program Chani in some diabolical way, and Scytale threatens the infants with a knife while he negotiates with Alia.
Duncan notes the irony that Paul and Chani's deaths had enabled them to triumph against their enemies, and that Paul has escaped deification by walking into the desert as a man, while guaranteeing Fremen support for the Atreides line.


Dune: House Harkonnen by Kevin J. Anderson
Genres: Science Fiction, Speculative fiction
Correlation: 0.80
Summary:
Leto and his friends, Kailea and Rhombur Vernius, are still struggling to liberate the siblings' former homeworld, but they have made little progress so far.
Kailea soon gives birth to Leto's son, Victor.
Kailea's lady-in-waiting, Chiara, is actually a Harkonnen agent sent to poison Kailea's mind against Leto.
Matters are complicated further with the arrival of Jessica, a Bene Gesserit and the secret daughter of Reverend Mother Gaius Helen Mohiam and Baron Vladimir Harkonnen (though Jessica herself is unaware of her parentage).
Jessica is presented to Leto as a gift from the Bene Gesserit, although the sisterhood has the ulterior motive of using the pair in their breeding program.
Fearing that Leto will guess that she is responsible for the death of their son and driven by guilt, Kailea kills her lady-in-waiting and then commits suicide by jumping out a window.
The Tleilaxu offer to grow a ghola of Leto's deceased son in exchange for the barely alive body of Rhombur Vernius.
Leto and Jessica fall deeply in love, leading Jessica to decide to conceive a son for Leto's sake, directly disobeying the Bene Gesserit's order that she have a daughter.
Gurney finally manages to escape by stowing himself away in a shipment of the ore, which happens to be a gift from Leto Atreides to his concubine Kailea.


Dune by Frank Herbert
Genres: Conspiracy fiction, Science Fiction, Philosophy, Adventure novel, Planetary romance, Fiction, Military science fiction
Correlation: 0.78
Summary:
The Emperor instead uses the centuries-old feud between House Atreides and House Harkonnen to disguise his assault, enlisting the brilliant and power-hungry Baron Vladimir Harkonnen in his plan to trap and eliminate the Atreides.
Leto's control of the only planet capable of spice production would increase the power of House Atreides, which has not, historically, been influential or wealthy.
Both the Emperor and the Baron Harkonnen show increasing concern at the fervor of religious fanaticism shown on Arrakis for this "Muad'Dib", not guessing that this leader is the presumed-dead Paul.
Completely loyal to the Atreides, Gurney is convinced that Jessica is the traitor who caused the House's downfall, and nearly kills her before being stopped by Paul.
In an Imperial attack on a Fremen settlement, Paul and Chani's son Leto is killed, and the four-year-old Alia is captured by Sardaukar and brought to the planet's capital Arrakeen, where the Baron Harkonnen is attempting to thwart the Fremen jihad under the close watch of the Emperor.
The Emperor is surprised at Alia's defiance of his power and her confidence in her brother, whom she reveals to be Paul Atreides.
Paul quickly overtakes the city's defenses and confronts the Emperor, threatening to destroy the spice, thereby ending space travel and crippling both Imperial power and the Bene Gesserit in one blow.
However, despite being Emperor of the Known Universe, Paul realizes that he will not be able to stop the jihad he has seen in his visions, his legendary status among the Fremen having grown past the point where he can control it.


God Emperor of Dune by Frank Herbert
Genres: Science Fiction, Speculative fiction, Children's literature, Fiction
Correlation: 0.78
Summary:
The seemingly immortal God Emperor Leto II has ruled his Empire for more than 3,500 years, his lifespan lengthened due to his decision in Children of Dune to merge his human body with sandtrout, the haploid phase of the giant sandworms of Arrakis.
Leto has employed a series of gholas grown from the cells of Duncan Idaho, the faithful Swordmaster of House Atreides.
Although Leto knows the important purpose of Siona, as long as she doesn't serve the "Golden Path" she would be expendable, and he would have to take measures for the breeding paths that he would have to take to replace her.
For her part, Hwi desires nothing more than to serve the God Emperor, and she quickly becomes a confidante, finally expressing her love of Leto.
Through discussions with Moneo and Leto, Duncan learns about Leto's transformation, the Fish Speakers, and the oppressive measures Leto takes to maintain his absolute control over the Empire.
Leto and Hwi decide to marry, and lead a wedding procession from Leto's Little Citadel to Tuono Village, where Duncan and Siona have been sent.
While crossing the Idaho River, Siona orders Nayla to cut the supports of the bridge with a lasgun, spilling Moneo, Hwi, Leto, and a number of courtiers into the jagged rocks in the canyon below.
In a final conversation with Siona and Duncan, Leto reveals that Siona is the embodiment of the Golden Path, a human completely shielded from prescient view.
After revealing the location of his secret spice hoard, Leto dies, leaving Duncan and Siona to face the task of managing the empire.


Paul of Dune by Kevin J. Anderson
Genres: Science Fiction, Speculative fiction
Correlation: 0.74
Summary:
House Ecaz of Ecaz and House Moritani of Grumman are embroiled in a generations-long feud, and an Atreides-Ecazi alliance is set to be formalized by Leto's marriage to the Archduke Armand Ecaz's daughter Illesa.
Leto and Armand lead a retaliatory attack on Grumman, not realizing that the Moritani forces have been supplemented by troops from House Harkonnen, sworn enemies of the Atreides.
After the fall of Padishah Emperor Shaddam Corrino IV and Paul's ascension to the Imperial throne, Paul's Fremen forces are engaged on multiple fronts, fighting the Houses that refuse to recognize Atreides rule.
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
